Dokumente/normalformen.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
<!-- 2023-05-30 Tue 11:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Beispiel Normalformen.</title>
<meta name="author" content="Lukas Wais" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Beispiel Normalformen.</h1>
<p>
Angenommen, wir haben eine Tabelle mit dem Namen Kundenbestellungen:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Kundennummer</b></td>
<td class="org-left">Kunde</td>
<td class="org-left">Produkt</td>
<td class="org-left">Produktkategorie</td>
<td class="org-left">Produktbeschreibung</td>
</tr>
</tbody>
</table>

<p>
Diese Tabelle befindet sich in der 1. Normalform (1NF), da jedes Feld
atomar ist und nur einen Wert enthält. Jedoch haben wir Redundanz in den Spalten Produktkategorie und
Produktbeschreibung, da diese Informationen potenziell für mehrere Zeilen dupliziert werden.
</p>

<p>
Um diese Tabelle in die 2. Normalform (2NF) zu überführen, müssen wir sicherstellen, dass jedes
Nicht-Schlüssel-Attribut voll funktional vom gesamten Schlüssel abhängt. In diesem Fall bedeutet das,
dass die Spalten Produktkategorie und Produktbeschreibung vom Primärschlüssel Kundennummer abhängen.
</p>

<p>
Tabelle Kunden
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Kundennummer</b></td>
<td class="org-left">Kunde</td>
</tr>
</tbody>
</table>


<p>
Tabelle Bestellungen
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b><i>Kundennummer</i></b></td>
<td class="org-left"><b><b>Produkt</b></b></td>
</tr>
</tbody>
</table>


<p>
Tabelle Produkte
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Produkt</b></td>
<td class="org-left">Produktkategorie</td>
<td class="org-left">Produktbeschreibung</td>
</tr>
</tbody>
</table>


<p>
In der 3. Normalform (3NF) dürfen keine Nicht-Schlüssel-Attribute voneinander abhängen sein.
Ausgehend von der 2.NF müssen wir sicherstellen, dass keine Transitivitäten zwischen den Attributen
Produkt, Produktkategorie und Produktbeschreibung in der Tabelle Produkte auftreten.
</p>

<p>
Tabelle Kunden
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Kundennummer</b></td>
<td class="org-left">Kunde</td>
</tr>
</tbody>
</table>

<p>
Tabelle Bestellungen
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b><i>Kundennummer</i></b></td>
<td class="org-left"><b><b>Produkt</b></b></td>
</tr>
</tbody>
</table>

<p>
Tabelle Produkte
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Produkt</b></td>
<td class="org-left">Produktkategorie</td>
</tr>
</tbody>
</table>

<p>
Tabelle Produktbeschreibungen
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b><i>Produkt</i></b></td>
<td class="org-left">Produktbeschreibung</td>
</tr>
</tbody>
</table>


<p>
In diesem Schritt haben wir die Tabelle Produkte weiter in zwei separate Tabellen aufgeteilt.
Die Tabelle Produkte enthält nun nur noch die Produktinformationen und die Produktkategorie.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Lukas Wais</p>
<p class="date">Created: 2023-05-30 Tue 11:26</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
